#+TITLE: FiriX
#+AUTHOR: Kim Timothy Engh

* Usage
The only class that is required is the FiriX class. All public methods are implemented as class
methods, and to access those no instance needs to be created.

#+begin_src python :exports both :results output :python /home/kimothy/Software/python3-general-purpose/bin/python
from firix import FiriX
response = FiriX.market.ticker("BTCNOK")
print(response.json())
#+end_src

#+RESULTS:
: {'bid': '647119.6500000000000000', 'ask': '654943.1600000000000000', 'spread': '7823.5100000000000000'}

This will return a requests object that contains status, json package and so on. See documentation
on the Request object at [[https://requests.readthedocs.io/en/latest/][requests.readthedocs.io]].

The availble public methods are in the ~FiriX.market~ attribute.

To use the private methods, an instance of the class needs to be created. For this the =CLIENT_ID=
and =PRIVATE_KEY= is required. During initialization five more attributes are made available, ~order~,
~deposit~, ~balance~, ~coin~ and ==history==.

As an alternative to passing the =CLIENT_ID= and =PRIVATE_KEY= directly, it is also possible to store the =CLENT_ID=
 and =SECRET_KEY= with the class method =save_auth=.
 
#+begin_src python :noeval t :exports code
from firix import FiriX

FiriX.save_auth("MY_CLIENT_ID", "MY_SECRET_KEY")
#+end_src

This makes it possible to create a class instance using the =FiriX.with_auth= method, that uses the
stored =CLIENT_ID= and =SECRET_KEY=. The keys are stored using the well known python library [[https://pypi.org/project/keyring/][keyring]],
with uses the hosts own keyrings. This is completely optional.

#+begin_src python :exports both :results output :python /home/kimothy/Software/python3-general-purpose/bin/python
from firix import FiriX

fx = FiriX.with_auth()
response = fx.history.transactions(year='2024')

print(response)
#+end_src

#+RESULTS:
: <Response [200]>

In general this package follows the API documentation closely, however to simplify similar
endpoints, some have been consolidated to one function. Depending on the input parameters the
request will be dispatched to the correct api endpoint.

